# 2026年01月15日17时02分19秒
# xxx@qq.com
print("start")
# print() 是一个内置函数，用于将文本输出到控制台。
# "start" 是一个字符串字面量，它将被打印到控制台。
i=100
# 这是一个赋值语句。
# i 是一个变量名。
# = 是赋值运算符。
# 100 是一个整数值，它被赋给变量 i。
print("end")
# print() 是一个内置函数，用于将文本输出到控制台。
# "end" 是一个字符串字面量，它将被打印到控制台。
print(i)
# print() 是一个内置函数，用于将文本输出到控制台。
# i 是一个变量，它的值（100）将被打印到控制台。
print("start")
# print() 是一个内置函数，用于将文本输出到控制台。
# "start" 是一个字符串字面量，它将被打印到控制台。
i=100
# 这是一个赋值语句。
# i 是一个变量名。
# = 是赋值运算符。
# 100 是一个整数值，它被赋给变量 i。
print("end")
# print() 是一个内置函数，用于将文本输出到控制台。
# "end" 是一个字符串字面量，它将被打印到控制台。
print(i)
# print() 是一个内置函数，用于将文本输出到控制台。
# i 是一个变量，它的值（100）将被打印到控制台。
